docs/architecture/diagrams/mermaid/structurizr-Components_Application.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram ["Application - Application - Components"]
    style diagram fill:#ffffff,stroke:#ffffff

    1["<div style='font-weight: bold'>User</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>End user who runs archlette<br />commands</div>"]
    style 1 fill:#08427b,stroke:#052e56,color:#ffffff
    2("<div style='font-weight: bold'>FileSystem</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>File system for reading and<br />writing files</div>")
    style 2 fill:#999999,stroke:#6b6b6b,color:#ffffff
    3("<div style='font-weight: bold'>Github Structurizr Repo</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>The github repo hosting the<br />Structurizr CLI releases.<br />https://github.com/structurizr/cli/releases/download/v${TOOL_VERSIONS.structurizr}/structurizr-cli.zip</div>")
    style 3 fill:#999999,stroke:#6b6b6b,color:#ffffff
    4("<div style='font-weight: bold'>Github PlantUML Repo</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>The github repo hosting the<br />PlantUML CLI releases.<br />https://github.com/plantuml/plantuml/releases/download/v${TOOL_VERSIONS.plantuml}/plantuml-${TOOL_VERSIONS.plantuml}.jar</div>")
    style 4 fill:#999999,stroke:#6b6b6b,color:#ffffff
    5("<div style='font-weight: bold'>Local System's unzip utility</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>The zip extraction utility on<br />the local system (unzip on<br />Unix, Expand-Archive on<br />Windows).</div>")
    style 5 fill:#999999,stroke:#6b6b6b,color:#ffffff
    6("<div style='font-weight: bold'>File System</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>The local file system for<br />caching downloaded tools.</div>")
    style 6 fill:#999999,stroke:#6b6b6b,color:#ffffff

    subgraph 8 ["Application"]
      style 8 fill:#ffffff,stroke:#2e6295,color:#2e6295

      10("<div style='font-weight: bold'>extractors</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>ArchletteIR aggregation<br />utilities | Extraction stage<br />of the AAC pipeline</div>")
      style 10 fill:#85bbf0,stroke:#5d82a8,color:#000000
      11("<div style='font-weight: bold'>validators</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Validation stage of the AAC<br />pipeline | Base IR validator<br />for Archlette pipeline</div>")
      style 11 fill:#85bbf0,stroke:#5d82a8,color:#000000
      12("<div style='font-weight: bold'>generators</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Generation stage of the AAC<br />pipeline | Structurizr DSL<br />Generator (Template-based)</div>")
      style 12 fill:#85bbf0,stroke:#5d82a8,color:#000000
      13("<div style='font-weight: bold'>renderers</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Render stage of the AAC<br />pipeline | PlantUML image<br />renderer | Structurizr DSL<br />export renderer</div>")
      style 13 fill:#85bbf0,stroke:#5d82a8,color:#000000
      14("<div style='font-weight: bold'>docs</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Documentation stage of the<br />AAC pipeline | Markdown<br />documentation generator</div>")
      style 14 fill:#85bbf0,stroke:#5d82a8,color:#000000
      15("<div style='font-weight: bold'>core</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Dynamic ESM module loader |<br />Stage module interfaces for<br />the AAC pipeline | Stage<br />module loaders | Tool<br />management for external<br />rendering tools |<br />Architecture-as-Code (AAC)<br />configuration types and<br />schemas | Archlette<br />Intermediate Representation<br />(IR) types and schemas | Core<br />pipeline types</div>")
      style 15 fill:#85bbf0,stroke:#5d82a8,color:#000000
      16("<div style='font-weight: bold'>core/path</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div>")
      style 16 fill:#85bbf0,stroke:#5d82a8,color:#000000
      17("<div style='font-weight: bold'>basic_node</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>TypeScript/JavaScript code<br />extractor</div>")
      style 17 fill:#85bbf0,stroke:#5d82a8,color:#000000
      18("<div style='font-weight: bold'>basic</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Basic Python Extractor for<br />Archlette Extracts<br />architecture information from<br />Python source code</div>")
      style 18 fill:#85bbf0,stroke:#5d82a8,color:#000000
      19("<div style='font-weight: bold'>basic_wrangler</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Cloudflare Wrangler<br />deployment extractor</div>")
      style 19 fill:#85bbf0,stroke:#5d82a8,color:#000000
      20("<div style='font-weight: bold'>basic_python</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div>")
      style 20 fill:#85bbf0,stroke:#5d82a8,color:#000000
      9("<div style='font-weight: bold'>CLI</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Archlette CLI -<br />Architecture-as-Code toolkit</div>")
      style 9 fill:#85bbf0,stroke:#5d82a8,color:#000000
    end

    9-- "<div>Analyzes source code to<br />extract architecture<br />components</div><div style='font-size: 70%'></div>" -->10
    9-- "<div>Validates and enriches<br />intermediate representation</div><div style='font-size: 70%'></div>" -->11
    9-- "<div>Transforms IR into DSL<br />formats</div><div style='font-size: 70%'></div>" -->12
    9-- "<div>Converts DSL to visual<br />diagrams</div><div style='font-size: 70%'></div>" -->13
    9-- "<div>Provides shared utilities,<br />types, and module loading</div><div style='font-size: 70%'></div>" -->15
    10-- "<div>Provides IR types, validation<br />schemas, and module loading</div><div style='font-size: 70%'></div>" -->15
    10-- "<div>composed of node extractor</div><div style='font-size: 70%'></div>" -->17
    10-- "<div>composed of python extractor</div><div style='font-size: 70%'></div>" -->20
    10-- "<div>composed of cloudflare<br />wrangler extractor</div><div style='font-size: 70%'></div>" -->19
    11-- "<div>Provides IR types, validation<br />schemas, and module loading</div><div style='font-size: 70%'></div>" -->15
    12-- "<div>Provides IR types, path<br />resolution, and module<br />loading</div><div style='font-size: 70%'></div>" -->15
    13-- "<div>Provides types, module<br />loading, and tool management</div><div style='font-size: 70%'></div>" -->15
    14-- "<div>Provides types, module<br />loading, and path resolution</div><div style='font-size: 70%'></div>" -->15
    1-- "<div>Interacts with CLI</div><div style='font-size: 70%'></div>" -->9
    15-- "<div>Uses FileSystem for external<br />system integration</div><div style='font-size: 70%'></div>" -->2
    15-- "<div>Uses Github Structurizr Repo<br />for external system<br />integration</div><div style='font-size: 70%'></div>" -->3
    15-- "<div>Uses Github PlantUML Repo for<br />external system integration</div><div style='font-size: 70%'></div>" -->4
    15-- "<div>Uses Local System's unzip<br />utility for external system<br />integration</div><div style='font-size: 70%'></div>" -->5
    15-- "<div>Uses File System for external<br />system integration</div><div style='font-size: 70%'></div>" -->6
  end
